
import Header from '../Component/Header';

import Footer from '../Component/Footer';




const Life = () => {
  return (
    <>
    <Header />
    <h2>بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ</h2>
    <div className='section'>
      <h2>ٱلرَّحۡمَٰنُ (1) عَلَّمَ ٱلۡقُرۡءَانَ (2) خَلَقَ ٱلۡإِنسَٰنَ (3) عَلَّمَهُ ٱلۡبَيَانَ (4)</h2>
    </div>
    <div className='section'>
      <h2>ٱقۡرَأۡ وَرَبُّكَ ٱلۡأَكۡرَمُ (3) ٱلَّذِي عَلَّمَ بِٱلۡقَلَمِ (4) عَلَّمَ ٱلۡإِنسَٰنَ مَا لَمۡ يَعۡلَمۡ (5)</h2>
    </div>
    <h3>بداية الحكاية</h3>

    <div >
    <h2 className='section justify-content-center'>أَوَلَمۡ یَرَ ٱلَّذِینَ كَفَرُوۤا۟ أَنَّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقࣰا فَفَتَقۡنَـٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَاۤءِ كُلَّ شَیۡءٍ حَیٍّۚ أَفَلَا یُؤۡمِنُونَ</h2>
     <h2 className='section justify-content-center'>وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَاۤءِ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۗ </h2>
     
    </div> 

    <Footer />
  </>
  );
}

export default Life;
