import Header from "../Component/Header";

import Footer from "../Component/Footer";


const Software = () => {
  
  return (
    <>
      <Header />


      <div className="row" >
        
        <div className="col-10 section">
          <p>السوفت وير:👈 هي مجموعة من الأوامر يفهمها الكمبيوتر وينفذها، سهل تغيره وتحديثه ويتم تطويره بلغات البرمجة، يتكون من 👇
( أنظمة التشغيل ➖ مترجم لغات البرمجة للغة التي يفهمها الكمبيوتر➖ التطبيقات المختلفة للغات البرمجة )
فما هي علوم الكمبيوتر؟❓
🖐هي دراسة نظريات وأنظمة لتنفيذ الخوارزميات والأفكار المختلفة بأعلي أداء للسوفت وير مع عدم إهدار موارد الهاردوير.
🖐وعلوم الكمبيوتر في الأساس هي حل المشكلات💪
فهدفنا هو تطوير طرق حل المشكلة وتنفيذها بأفضل أداء👍
خطوات حل المشكلة👇
🔷فهم المشكلة
🔷 تخطيط لحل المشكلة عن طريق العلم والمعرفة
🔷 تنفيذ التخطيط
🔷 التحقق من كفاءة الحل ❗❕ 
  
طيب يعني ايه النظام الثنائي Binary system❓
 Bi⬅هي كلمة مأخوذة من اللغة اللتينية وبمعني ثنائي✌
فهو نظام مكون من رقمين فقط ( صفر & واحد )
وزي ما عرفنا مع عم آشر إن النظم العددية اتطورت لتناسب احتياجتنا وتحل مشاكلنا، فمن هنا احتاجنا لعلوم الكمبيوتر💻
طيب احنا عندنا لغات بشرية اتفقنا عليها لنتواصل بيها ولكن كيف نتواصل مع الكمبيوتر؟❓
الملمس الفيزيائي الوحيد الذي يشعر به آلة الكمبيوتر هو الكهرباء💥
فلو تخيلنا أن أجزاء الهاردوير عبارة عن مصباح كهربائي (لمبة)💡
يمكننا التفكير في الرقم صفر 0 على أنه مصباح كهربائي مطفأ ⛔والرقم واحد 1 على أنه مصباح كهربائي قيد التشغيل🔛
والمصابيح الكهربائية💡 بالطبع في عالمنا البشري تحتاج فقط إلى الكهرباء لتشغيلها، فإذا حصلنا بطريقة ما على الكهرباء في جهاز الكمبيوتر فسيبدو هذا إدخالًا كافيًا لتشغيل المصباح الكهربائي أو إيقاف تشغيله،
🖐هذا ما بداخل أجهزة الكمبيوتر لدينا 👈 الترانزستورات (Transistors)، والمعروفة أيضًا بالمفاتيح (switches). وهذه الترانزستورات، التي يبلغ عددها الآن المليارات في أكثر أجهزة الكمبيوتر حداثة، هي مفاتيح ضوئية صغيرة جدًا جدًا، والتي إذا تم تشغيلها تسمح لنا بتخزين الوحايد (1s)، إذا تم إيقاف تشغيلها تسمح لنا بتخزين الأصفار(0s).
وباستخدام العديد والعديد من الترانزستورات هل يمكننا تخزين القيم وأنواع البيانات المختلفة⁉
</p>
        
        </div>
        
      </div>

      <Footer />
    </>
  );
};

export default Software;
